5_Components/camel-webservice/src/main/resources/data/soap-saveCustomer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tra="http://training.gpte.redhat.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <tra:saveCustomer>
            <customer>
                <name>Foo</name>
                <address>my address 123</address>
                <numOrders>589</numOrders>
                <revenue>2750.0</revenue>
                <test>100.0</test>
                <type>PRIVATE</type>
            </customer>
        </tra:saveCustomer>
    </soapenv:Body>
</soapenv:Envelope>